app/controllers/galleries_controller.rb

  def extract
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 14)

  def index
    @galleries = Gallery.all
---
SELECT * FROM `galleries`

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 0)

  def create
    @gallery = Gallery.new(params[:gallery])
    if @gallery.save
---
INSERT INTO "galleries" ("name", "collection_file_name", "created_at", "updated_at", "collection_updated_at", "shoot_date", "collection_content_type", "collection_file_size", "user_id") VALUES('Blabber', NULL, '2010-12-07 06:48:20', '2010-12-07 06:48:20', NULL, '2010-12-07', NULL, NULL, 3)

  def edit
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 1)

  def update
    @gallery = Gallery.find(params[:id])
    if @gallery.update_attributes(params[:gallery])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 1)
UPDATE "galleries" SET "collection_file_size" = 590500, "updated_at" = '2010-12-15 01:26:10', "collection_file_name" = 'delrosario.zip', "collection_updated_at" = '2010-12-15 01:26:10', "collection_content_type" = 'application/zip' WHERE "id" = 4

  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 0)
DELETE FROM `galleries` WHERE `id` = 1