app/controllers/photos_controller.rb

  def show
    @photo = @gallery.photos.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1 AND (`photos`.gallery_id = 2))

  def create
    @photo = @gallery.photos.build(params[:photo])
    if @photo.save
---
INSERT INTO "photos" ("name", "rating", "created_at", "image_file_name", "image_file_size", "updated_at", "image_content_type", "image_updated_at", "gallery_id") VALUES('Senior Photos', NULL, '2010-12-05 21:43:12', 'delrosario_001_std.jpg', 24488, '2010-12-05 21:43:12', 'image/jpeg', '2010-12-05 21:43:12', 1)

  def edit
    @photo = @gallery.photos.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 4 AND (`photos`.gallery_id = 3))

  def update
    @photo = @gallery.photos.find(params[:id])
    if @photo.update_attributes(params[:photo])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 4 AND (`photos`.gallery_id = 3))
UPDATE `photos` SET `updated_at` = '2010-12-05 19:41:00', `image_file_size` = 22973, `image_file_name` = 'fwp.jpg', `image_updated_at` = '2010-12-05 19:41:00', `image_content_type` = 'image/jpeg' WHERE `id` = 10

  def destroy
    @photo = @gallery.photos.find(params[:id])
    @photo.destroy
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1 AND (`photos`.gallery_id = 2))
DELETE FROM `photos` WHERE `id` = 1